import UserDefinedTable from 'bcdice/lib/user_defined_dice_table';
export { tableFromCommand };


const TABLE_BATTLE = `戦闘発生
2D6
2:キャラクター
3:3-3エスパー
4:3-2エスパー
5:2-2エスパー
6:レイガン隊   3人
7:ブラスター隊 3人
8:バズーカ隊   3人
9:ジャマー1 3人、武器は武装チャート WPN で決定する。
10:ジャマー2 3人、武器は武装チャート WPN で決定する。
11:ジャマー3 4人、武器は武装チャート WPN で決定する。
12:ジャマー4 5人、武器は武装チャート WPN で決定する。
`

const TABLE_WEAPON = `武装
2D6
2:上空からG弾
3:TRAP1
4:レイガン
5:レイガン
6:ブラスター
7:ブラスター
8:ブラスター
9:バズーカ
10:バズーカ
11:ビーキャン装甲車
12:上空からD弾
`

const TABLE_TRAP1 = `TRAP1
2D6
2:死人苔 1Dで耐久力チェックに失敗すると、0Lvになる。かかったキャラと同じマスにいるキャラは耐久力チェックをし、失敗すると動揺に0Lvになる
3:ネクラ 全員10:1ダメージ
4:ダンディー シルエットが女性だと2D回休み。トワイライト・ウォーリアはOPENすると勝利する。
5:幻覚攻撃 2Dでレベルチェック。失敗すると出目の火力のダメージを食らう。ぞろ目はもう１回。
6:ダイバー 耐久8のブラスター隊4人。Eストロハイムは正体が露見し、装備が回復する。逮捕不可。
7:締め切り シルエットが聖悠紀だと2D6回、ロックだと1D6回休み。
8:サイバー 耐久10のブラスター隊5人。ラウンドの最後に2回目の攻撃。逮捕不可。
9:パッX 1D6回休み
10:小麦 一時的にゲーム盤から除外される。自分の手番で1D6で56を振れば帰還。
11:TRAP2 TRAP2へ。
12:暗黒騎士団 上空からD弾。ラウンドの最後に1D6で456でオーバーヒート。機械攻撃。
`

const TABLE_TRAP2 = `TRAP2
2D6
2:遺伝子再編成 コマンドGENEの結果を適用。
3:白カードひき直し 白カードを引き直す。
4:ブラスト レベル+1、耐久-1、精神-1、パワー+20、同系列のカードは出せる最大のものを使用しなければならない。より高いレベルのカードをチェックすることは可能。死んで復活するか、もう一度かかると治る。
5:ロックに会う 説得される。
6:白顔露見 白カードと顔カードが露見する。
7:共振樹 レベルによって違う火力のダメージを食らう。火力は以下の通り。0:0 1:3 2:6 3:10 4:20 5:30 6:50
8:結婚・離婚 独身のキャラは既婚に、既婚のキャラは独身になる。
9:白カードもう１枚 白カードをもう１枚引く。
10:プラグ 5レベル、パワー50のエスパーになる。自分の手番か、戦闘時のラウンドの最初にコマンドPLUGの効果を適用。
11:TRAP3 TRAP3へ。
12:全カード露見 キャラクターカードと白カード、顔カード、能力カードが露見する。
`

const TABLE_TRAP3 = `TRAP3
2D6
2:真の人格 リインカーネーション。
3:結界 ゲームから除外される。そこにいたチェックで4以下を振ると復帰できる。
4:あたり 惑星カードを2枚引く。引く度に効果を適用する。
5:信念逆転 GoodはEvilに、EvilはGoodに、E/GはG/Eになる。リュカーン、エルナ、カルダームは顔カードの色が逆転する。ロックはかからない。
6:全員ランテレ 全員ランダムテレポート。
7:情報入手3枚 情報入手3枚、ジェシカは入れることができるが、トワイライト・ウォーリアは入らない。
8:攻守逆転 Goodが拠点を防衛し、Evilが破壊するようになる。もう一度適用されると元の状態に戻る。
9:真のG/E 顔カードが青であればEvilに、赤であればGoodになる。個別勝利条件は消える。ロックはかからない。
10:遺伝子再編成 コマンドGENEの結果を適用。
11:TRAP4 TRAP4へ。
12:一列破壊 ランダムに1列が破壊される。そこにいたキャラはレベルチェックに成功しないと死ぬ。ただし、船を持っているキャラは6Lvとしてチェックできる。ブラックメイデンは船扱いにならない。
`

const TABLE_TRAP4 = `TRAP3
2D6
2:全員真の人格 全員リインカーネーション。
3:全員10:1 全員に10:1のダメージ。ロックもかかる。
4:全員ブラスト 全員ブラストする。レベル+1、耐久-1、精神-1、パワー+20、同系列のカードは出せる最大のものを使用しなければならない。より高いレベルのカードをチェックすることは可能。死んで復活するか、もう一度かかると治る。
5:全員ロックに会う 全員説得される。
6:全員惑星カード1枚 全員惑星カード1枚引く
7:全員ランダムアクシデント 全員コマンドRAの効果を適用する。
8:全員白カードもう1枚 全員白カードを1枚引ける。
9:全員全カード露見 全員全カードが露見する。
10:全員遺伝子再編成 全員遺伝子再編成する。
11:TRAP1 TRAP1へ。
12:全土破壊 全土が破壊される。全員レベルチェックし、成功したらゲームに勝利、失敗したら敗北する。ただし、船を持っているキャラは6Lvとしてチェックできる。ブラックメイデンは船扱いにならない。
`

const TABLE_GENE = `遺伝子再編成
1D6
1:精神+1、耐久-1
2:精神+1、レベル-1
3:耐久+1、レベル-1
4:レベル+1、精神-1
5:耐久+1、精神-1
6:レベル+1、耐久-1
`

const TABLE_RANDOM_ACCIDENT = `ランダムアクシデント
1D6
1:真の人格 リインカーネーションする。
2:ブラスト レベル+1、耐久-1、精神-1、パワー+20、同系列のカードは出せる最大のものを使用しなければならない。より高いレベルのカードをチェックすることは可能。死んで復活するか、もう一度かかると治る。
3:信念逆転 GoodはEvilに、EvilはGoodに、E/GはG/Eになる。リュカーン、エルナ、カルダームは顔カードの色が逆転する。ロックはかからない。
4:ロックに会う 説得される。
5:遺伝子再編成 コマンドGENEの結果を適用。
6:何もなし。
`

const TABLE_MINISTER = `大臣の特権
2D6
2:亜空間レーザー 2D6で7以下でLv.7火力100が出る船
3:キャラクター
4:帝国艦隊 船x2
5:Lv4ESPフィールド
6:ビームキャノン
7:帝国軍巡洋艦 船
8:Lv3ジャマー
9:Lv3スーツ
10:何もなし
11:何もなし
12:大臣解任 以後特権は使えなくなる
`

const TABLE_ARRIVE = `そこに居たチェック
2D6
2:そこに居た。
3:そこに居た。
4:そこに居た。
5:2ラウンド目に到着。
6:3ラウンド目に到着。
7:4ラウンド目に到着。
8:居なかった。
9:居なかった。
10:居なかった。
11:居なかった。
12:居なかった。
`

const TABLE_REVIVE = `実は生きていたチェック
2D6
2:実は生きていた。
3:残留思念チェック コマンドZSの効果を適用。
4:残留思念チェック コマンドZSの効果を適用。
5:残留思念チェック コマンドZSの効果を適用。
6:何も無かった。
7:何も無かった。
8:何も無かった。
9:何も無かった。
10:何も無かった。
11:何も無かった。
12:何も無かった。
`

const TABLE_ZANNRYU_SHINEN = `残留思念チェック
2D6
2:残留思念 火力50
3:残留思念 火力30
4:残留思念 火力20
5:残留思念 火力10
6:残留思念 火力10
7:何も無かった。
8:何も無かった。
9:何も無かった。
10:何も無かった。
11:何も無かった。
12:何も無かった。
`

const TABLE_TRANSFORMATION = `変身チェック
2D6
2:Lv+1,パワー+5
3:戦闘中のみコンバットカード+2
4:何もなし。
5:何もなし。
6:何もなし。
7:何もなし。
8:何もなし。
9:何もなし。
10:何もなし。
10:何もなし。
11:精神力+1
12:リインカーネーション
`

const TABLE_SHIP = `船
2D6
2:D弾 火力50
3:G弾 火力30
4:ビームキャノン
5:ビームキャノン
6:ビームキャノン
7:不発
8:不発
9:不発
10:不発
11:不発
12:誤爆 ビームキャノン
`

const TABLE_SHIP_BLACK_MAIDEN = `ブラックメイデン
2D6
2:粒子加速砲 火力100
3:ビームキャノン
4:ビームキャノン
5:ビームキャノン
6:ビームキャノン
7:不発
8:不発
9:不発
10:不発
11:不発
12:誤爆 ビームキャノン
`

const TABLE_SHIP_MOUSE = `マウス
2D6
2:重力ビーム 火力100
3:D弾 火力50
4:G弾 火力30
5:G弾 火力30
6:ビームキャノン
7:ビームキャノン
8:ビームキャノン
9:不発
10:不発
11:不発
12:誤爆 ビームキャノン
`

const TABLE_PLUG = `プラグ
2D6
2:プラグが抜けた。刺さる前の能力値に戻る。
3:プラグが抜けた。刺さる前の能力値に戻る。
4:何もなし。
5:何もなし。
6:何もなし。
7:何もなし。
8:何もなし。
9:何もなし。
10:戦闘・戦闘行動をしなければならない。
11:戦闘・戦闘行動をしなければならない。
12:爆死。
`

const TABLE_T13 = `T1-3
1D6
1:TRAP1
2:TRAP1
3:TRAP1
4:TRAP2
5:TRAP2
6:TRAP3
`

const TABLE_T14 = `T1-4
2D6
2:TRAP1
3:TRAP1
4:TRAP1
5:TRAP1
6:TRAP1
7:TRAP2
8:TRAP2
9:TRAP3
10:TRAP3
11:TRAP4
12:TRAP4
`

const TABLE_GEOID_CHARACTER = `ジオイド弾（キャラクター）
2D6
2:ジオイド弾 火力100
3:ジオイド弾 火力100
4:ジオイド弾 火力100
5:ジオイド弾 火力100
6:ジオイド弾 火力100
7:何も無し。自分の行動を行う。
8:何も無し。自分の行動を行う。
9:何も無し。自分の行動を行う。
10:しびれる。そのラウンドは行動不可。
11:しびれる。そのラウンドは行動不可。
12:しびれる。そのラウンドは行動不可。
`

const TABLE_GEOID_ITEM = `ジオイド弾（アイテム）
2D6
2:ジオイド弾 火力100
3:ジオイド弾 火力100
4:ジオイド弾 火力100
5:何も無し。自分の行動を行う。
6:何も無し。自分の行動を行う。
7:何も無し。自分の行動を行う。
8:何も無し。自分の行動を行う。
9:何も無し。自分の行動を行う。
10:しびれる。そのラウンドは行動不可。
11:しびれる。そのラウンドは行動不可。
12:しびれる。そのラウンドは行動不可。
`


const TABLE_HYPERSPACE_BEAM = `亜空間ビーム
2D6
2:亜空間ビーム Lv8 火力200、「亜空間ビーム」は破棄される。
3:何も無し。自分の行動を行う。
4:何も無し。自分の行動を行う。
5:何も無し。自分の行動を行う。
6:何も無し。自分の行動を行う。
7:何も無し。自分の行動を行う。
8:しびれる。そのラウンドは行動不可。
9:しびれる。そのラウンドは行動不可。
10:しびれる。そのラウンドは行動不可。
11:暴発 その場にいるキャラ全員Lv8、火力200の攻撃を喰らう。「亜空間ビーム」は破棄される
12:暴発 その場にいるキャラ全員Lv8、火力200の攻撃を喰らう。「亜空間ビーム」は破棄される
`


const tableFromCommand = (command: string): UserDefinedTable => {
    const commandToTableText = {
        "ARR": TABLE_ARRIVE,
        "REV": TABLE_REVIVE,
        "ZS": TABLE_ZANNRYU_SHINEN,
        "TF": TABLE_TRANSFORMATION,
        "SHIP": TABLE_SHIP,
        "SHIP_BM": TABLE_SHIP_BLACK_MAIDEN,
        "SHIP_MS": TABLE_SHIP_MOUSE,
        "PLUG": TABLE_PLUG,
        "T1": TABLE_TRAP1,
        "T2": TABLE_TRAP2,
        "T3": TABLE_TRAP3,
        "T4": TABLE_TRAP4,
        "T1-3": TABLE_T13,
        "T1-4": TABLE_T14,
        "GEO": TABLE_GEOID_CHARACTER,
        "IGEO": TABLE_GEOID_ITEM,
        "HYB": TABLE_HYPERSPACE_BEAM,
        "BTL": TABLE_BATTLE,
        "WPN": TABLE_WEAPON,
        "GENE": TABLE_GENE,
        "RA": TABLE_RANDOM_ACCIDENT,
        "MNS": TABLE_MINISTER
    }

    const tableText = commandToTableText[command];

    const table = new UserDefinedTable(tableText);
    if (!table.validate()) {
        console.log("!!!!!!!!!!!!!!!!!!!!!!!something strange.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!");
    }
    return table;
}
